Тест/Тест/src/Documents/ПриходДенегНаСчет/ПриходДенегНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенегНаСчет</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <basedOn>Document.ЗаказНаДоставку</basedOn>
  <basedOn>Document.ПродажаЗапчастей</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ОплатыПоСделкам</registerRecords>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.БаланПоНакладной</registerRecords>
  <registerRecords>AccumulationRegister.БалансКлиента</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступлениеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>DocumentRef.ЗаказНаДоставку</types>
      <types>DocumentRef.ЗаказНаряд</types>
      <types>DocumentRef.ПрочиеДоходы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>EnumRef.ВидыПоступлений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
        <types>DocumentRef.ЗаказНаДоставку</types>
        <types>DocumentRef.ЗаказНаряд</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.Счета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Documents/АктВозврата/АктВозврата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктВозврата</name>
  <basedOn>Document.ПродажаЗапчастей</basedOn>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <registerRecords>AccumulationRegister.РегистрНакопления1</registerRecords>
  <registerRecords>AccumulationRegister.ОплатыПоСделкам</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.БалансКлиента</registerRecords>
  <attributes>
    <name>Продажа</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужбаДоставки</name>
    <type>
      <types>CatalogRef.Доставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кладовщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Разнесено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородОтправки</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыАктаВозврата</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозврата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозврата2</name>
    <type>
      <types>CatalogRef.ПричинаВозврата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>машина</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродНак</name>
      <type>
        <types>DocumentRef.ПоступлениеЗапчастей</types>
      </type>
    </attributes>
    <attributes>
      <name>укод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/CommonModules/РаботаСДокументамиВызовСервера/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСуммуПродажи(Продажа) Экспорт
	
	///+ГомзМА 29.07.2024
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходДенегНаСчет.Сделка.Ссылка КАК Продажа,
		|	СУММА(ПриходДенегНаСчет.СуммаДокумента) КАК СуммаПриходаДенег
		|ИЗ
		|	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет
		|ГДЕ
		|	ПриходДенегНаСчет.Сделка = &Сделка
		|	И ПриходДенегНаСчет.Проведен
		|СГРУППИРОВАТЬ ПО
		|	ПриходДенегНаСчет.Сделка.Ссылка";
	
	Запрос.УстановитьПараметр("Сделка", Продажа);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Попытка
		РезультатЗапроса.Следующий();
		СуммаПриход = Число(РезультатЗапроса.СуммаПриходаДенег);
	Исключение
		СуммаПриход = 0;
	КонецПопытки;

	ЗапросВозврат = Новый Запрос;
	ЗапросВозврат.Текст =
		"ВЫБРАТЬ
		|	СУММА(АктВозврата.ОбщаяСумма) КАК ОбщаяСумма
		|ИЗ
		|	Документ.АктВозврата КАК АктВозврата
		|ГДЕ
		|	АктВозврата.Продажа = &Продажа
		|	И АктВозврата.Проведен";
	
	ЗапросВозврат.УстановитьПараметр("Продажа", Продажа);
	
	РезультатЗапросаВозврат = ЗапросВозврат.Выполнить().Выбрать();
	
	Попытка
		РезультатЗапросаВозврат.Следующий();
		СуммаВозврат = Число(РезультатЗапросаВозврат.ОбщаяСумма);
	Исключение
		СуммаВозврат = 0;
	КонецПопытки;
	
	Результат = СуммаПриход - СуммаВозврат;
	
	Возврат Результат;
	///-ГомзМА 29.07.2024
	
КонецФункции

Функция ПолучитьСписокУчастниковРаботы(Заявка) Экспорт
	
	///+ГомзМА 29.07.2024
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаОтветственные.Сотрудник,
		|	ЗаказКлиентаОтветственные.Роль
		|ИЗ
		|	Документ.ЗаказКлиента.Ответственные КАК ЗаказКлиентаОтветственные
		|ГДЕ
		|	ЗаказКлиентаОтветственные.Ссылка.Ссылка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	Результат = Запрос.Выполнить().Выгрузить();
		
	Возврат Результат;
	///-ГомзМА 29.07.2024
	
КонецФункции

#КонецОбласти
